#!/usr/bin/perl
my $d = 
{'22-19' => 'Алтайский край',
'28-20' => 'Амурская область',
'29-21' => 'Архангельская область',
'30-22' => 'Астраханская область',
'31-23' => 'Белгородская область',
'32-24' => 'Брянская область',
'33-25' => 'Владимирская область',
'34-26' => 'Волгоградская область',
'35-27' => 'Вологодская область',
'36-28' => 'Воронежская область',
'79-29' => 'Еврейская автономная область',
'75-30' => 'Забайкальский край',
'37-31' => 'Ивановская область',
'38-32' => 'Иркутская область',
'39-33' => 'Калининградская область',
'40-34' => 'Калужская область',
'41-35' => 'Камчатский край',
'42-36' => 'Кемеровская область',
'43-37' => 'Кировская область',
'44-38' => 'Костромская область',
'23-39' => 'Краснодарский край',
'24-40' => 'Красноярский край',
'45-41' => 'Курганская область',
'46-42' => 'Курская область',
'47-43' => 'Ленинградская область',
'48-44' => 'Липецкая область',
'49-45' => 'Магаданская область',
'50-46' => 'Московская область',
'51-47' => 'Мурманская область',
'83-48' => 'Ненецкий автономный округ',
'52-49' => 'Нижегородская область',
'53-50' => 'Новгородская область',
'54-51' => 'Новосибирская область',
'55-52' => 'Омская область',
'56-53' => 'Оренбургская область',
'57-54' => 'Орловская область',
'58-55' => 'Пензенская область',
'59-56' => 'Пермский край',
'25-57' => 'Приморский край',
'60-58' => 'Псковская область',
'1-59' => 'Республика Адыгея',
'4-60' => 'Республика Алтай',
'2-61' => 'Республика Башкортостан',
'3-62' => 'Республика Бурятия',
'5-63' => 'Республика Дагестан',
'6-64' => 'Республика Ингушетия',
'7-65' => 'Республика Кабардино-Балкария',
'8-66' => 'Республика Калмыкия',
'9-67' => 'Республика Карачаево-Черкесия',
'10-68' => 'Республика Карелия',
'11-69' => 'Республика Коми',
'91-70' => 'Республика Крым',
'12-71' => 'Республика Марий Эл',
'13-72' => 'Республика Мордовия',
'14-73' => 'Республика Саха (Якутия)',
'15-74' => 'Республика Северная Осетия (Алания)',
'16-75' => 'Республика Татарстан',
'17-76' => 'Республика Тыва',
'18-77' => 'Республика Удмуртия',
'19-78' => 'Республика Хакасия',
'20-79' => 'Республика Чечня',
'21-80' => 'Республика Чувашия',
'61-81' => 'Ростовская область',
'62-82' => 'Рязанская область',
'63-83' => 'Самарская область',
'64-84' => 'Саратовская область',
'65-85' => 'Сахалинская область',
'66-86' => 'Свердловская область',
'67-87' => 'Смоленская область',
'26-88' => 'Ставропольский край',
'68-89' => 'Тамбовская область',
'69-90' => 'Тверская область',
'70-91' => 'Томская область',
'71-92' => 'Тульская область',
'72-93' => 'Тюменская область',
'73-94' => 'Ульяновская область',
'27-95' => 'Хабаровский край',
'86-96' => 'Ханты-Мансийский Автономный округ - ЮГРА',
'74-97' => 'Челябинская область',
'87-98' => 'Чукотский автономный округ',
'89-99' => 'Ямало-Ненецкий автономный округ',
'76-100' => 'Ярославская область'};
my $names = {};
my $ids = {};
for(keys %{$d}){
  my $k = $_;
  my @d = split("-",$k);
  print $d->{$k}."\n";
  $names->{$d[0]}=$d->{$k};
  $ids->{$d[0]}=$d[1];
}

open(ST,"<map_new.svg");
open(SG,">map_original.svg");
while(<ST>){
	if ($_ =~ m/title="(.+?)"\sid="(\d+)"/){
		my $o_id = $2+0;
		my $name = $names->{$o_id};
		my $id = $ids->{$o_id};
		$_ =~ s/title="$1"\sid="$2"/title="$name" id="$id"/s;
	}
	print SG $_;
}
close ST;
close SG;